numbers = list(map(int, input("Введите список чисел через запятую: ").split(','))) # Запрашиваем у пользователя ввод списка чисел, разделенных запятыми, и преобразуем их в список целых чисел, которые будем складывать между собой.
total_sum = 0 # Переменная для внесения суммы.
for number in numbers: # Цикл, который перебирает каждый элемент из списка.
    total_sum += number # Высчитываем сумму каждого перебранного элемента списка.
print(f"Сумма всех чисел в списке: {total_sum}") # Выводим полученный результат суммы в консоль.